app/controllers/timeline_events_controller.rb

SELECT * FROM `timeline_events`
---
  def index
    @timeline_events = TimelineEvent.all