app/controllers/timelines_controller.rb

SELECT * FROM `timelines`
---
  def index
    @timelines = Timeline.all

SELECT * FROM `timelines` WHERE (`timelines`.`id` = 1)
---
  def show
    @timeline = Timeline.find(params[:id])

INSERT INTO `timelines` (`created_at`, `title`, `updated_at`, `template`, `source`) VALUES('2010-06-13 19:00:02', 'Deepwater Horizon Response', '2010-06-13 19:00:02', '', 'http://www.deepwaterhorizonresponse.com/go/doctype/2931/52419/')
---
  def create
    @timeline = Timeline.new(params[:timeline])

    respond_to do |format|
      if @timeline.save

SELECT * FROM `timelines` WHERE (`timelines`.`id` = 1)
---
  def timeline
    @timeline = params[:id] ? Timeline.find(params[:id]) : Timeline.first